Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/include/pio/pic32cz2051ca91176.h
#define PIN_PA20B_AC_AIN2                          _UINT32_(20)
#define MUX_PA20B_AC_AIN2                          _UINT32_(1) 
#define PINMUX_PA20B_AC_AIN2                       ((PIN_PA20B_AC_AIN2 << 16) | MUX_PA20B_AC_AIN2)
#define PORT_PA20B_AC_AIN2                         (_UINT32_(1) << 20)

#define PIN_PA19B_AC_AIN3                          _UINT32_(19)
#define MUX_PA19B_AC_AIN3                          _UINT32_(1) 
#define PINMUX_PA19B_AC_AIN3                       ((PIN_PA19B_AC_AIN3 << 16) | MUX_PA19B_AC_AIN3)
#define PORT_PA19B_AC_AIN3                         (_UINT32_(1) << 19)

#define PIN_PC07B_AC_CMP0                          _UINT32_(71)
#define MUX_PC07B_AC_CMP0                          _UINT32_(1) 
#define PINMUX_PC07B_AC_CMP0                       ((PIN_PC07B_AC_CMP0 << 16) | MUX_PC07B_AC_CMP0)
#define PORT_PC07B_AC_CMP0                         (_UINT32_(1) << 7)

#define PIN_PC06B_AC_CMP1                          _UINT32_(70)
#define MUX_PC06B_AC_CMP1                          _UINT32_(1) 
#define PINMUX_PC06B_AC_CMP1                       ((PIN_PC06B_AC_CMP1 << 16) | MUX_PC06B_AC_CMP1)
#define PORT_PC06B_AC_CMP1                         (_UINT32_(1) << 6)

/* ========== PORT definition for ADC peripheral ========== */
#define PIN_PA17B_ADC_VINM16                       _UINT32_(17)
#define MUX_PA17B_ADC_VINM16                       _UINT32_(1) 
#define PINMUX_PA17B_ADC_VINM16                    ((PIN_PA17B_ADC_VINM16 << 16) | MUX_PA17B_ADC_VINM16)
#define PORT_PA17B_ADC_VINM16                      (_UINT32_(1) << 17)

#define PIN_PA15B_ADC_VINM18                       _UINT32_(15)
#define MUX_PA15B_ADC_VINM18                       _UINT32_(1) 
#define PINMUX_PA15B_ADC_VINM18                    ((PIN_PA15B_ADC_VINM18 << 16) | MUX_PA15B_ADC_VINM18)
#define PORT_PA15B_ADC_VINM18                      (_UINT32_(1) << 15)

#define PIN_PA28B_ADC_VINM20                       _UINT32_(28)
#define MUX_PA28B_ADC_VINM20                       _UINT32_(1) 
#define PINMUX_PA28B_ADC_VINM20                    ((PIN_PA28B_ADC_VINM20 << 16) | MUX_PA28B_ADC_VINM20)
#define PORT_PA28B_ADC_VINM20                      (_UINT32_(1) << 28)

#define PIN_PA13B_ADC_VINM24                       _UINT32_(13)
#define MUX_PA13B_ADC_VINM24                       _UINT32_(1) 
#define PINMUX_PA13B_ADC_VINM24                    ((PIN_PA13B_ADC_VINM24 << 16) | MUX_PA13B_ADC_VINM24)
#define PORT_PA13B_ADC_VINM24                      (_UINT32_(1) << 13)

#define PIN_PA11B_ADC_VINM26                       _UINT32_(11)
#define MUX_PA11B_ADC_VINM26                       _UINT32_(1) 
#define PINMUX_PA11B_ADC_VINM26                    ((PIN_PA11B_ADC_VINM26 << 16) | MUX_PA11B_ADC_VINM26)
#define PORT_PA11B_ADC_VINM26                      (_UINT32_(1) << 11)

#define PIN_PA26B_ADC_VINM28                       _UINT32_(26)
#define MUX_PA26B_ADC_VINM28                       _UINT32_(1) 
#define PINMUX_PA26B_ADC_VINM28                    ((PIN_PA26B_ADC_VINM28 << 16) | MUX_PA26B_ADC_VINM28)
#define PORT_PA26B_ADC_VINM28                      (_UINT32_(1) << 26)

#define PIN_PA09B_ADC_VINM32                       _UINT32_(9) 
#define MUX_PA09B_ADC_VINM32                       _UINT32_(1) 
#define PINMUX_PA09B_ADC_VINM32                    ((PIN_PA09B_ADC_VINM32 << 16) | MUX_PA09B_ADC_VINM32)
#define PORT_PA09B_ADC_VINM32                      (_UINT32_(1) << 9)

#define PIN_PA07B_ADC_VINM34                       _UINT32_(7) 
#define MUX_PA07B_ADC_VINM34                       _UINT32_(1) 
#define PINMUX_PA07B_ADC_VINM34                    ((PIN_PA07B_ADC_VINM34 << 16) | MUX_PA07B_ADC_VINM34)
#define PORT_PA07B_ADC_VINM34                      (_UINT32_(1) << 7)

#define PIN_PA24B_ADC_VINM36                       _UINT32_(24)
#define MUX_PA24B_ADC_VINM36                       _UINT32_(1) 
#define PINMUX_PA24B_ADC_VINM36                    ((PIN_PA24B_ADC_VINM36 << 16) | MUX_PA24B_ADC_VINM36)
#define PORT_PA24B_ADC_VINM36                      (_UINT32_(1) << 24)

#define PIN_PB03B_ADC_VINP0                        _UINT32_(35)
#define MUX_PB03B_ADC_VINP0                        _UINT32_(1) 
#define PINMUX_PB03B_ADC_VINP0                     ((PIN_PB03B_ADC_VINP0 << 16) | MUX_PB03B_ADC_VINP0)
#define PORT_PB03B_ADC_VINP0                       (_UINT32_(1) << 3)

#define PIN_PB02B_ADC_VINP1                        _UINT32_(34)
#define MUX_PB02B_ADC_VINP1                        _UINT32_(1) 
#define PINMUX_PB02B_ADC_VINP1                     ((PIN_PB02B_ADC_VINP1 << 16) | MUX_PB02B_ADC_VINP1)
#define PORT_PB02B_ADC_VINP1                       (_UINT32_(1) << 2)

#define PIN_PB01B_ADC_VINP2                        _UINT32_(33)
#define MUX_PB01B_ADC_VINP2                        _UINT32_(1) 
#define PINMUX_PB01B_ADC_VINP2                     ((PIN_PB01B_ADC_VINP2 << 16) | MUX_PB01B_ADC_VINP2)
#define PORT_PB01B_ADC_VINP2                       (_UINT32_(1) << 1)

#define PIN_PB00B_ADC_VINP3                        _UINT32_(32)
#define MUX_PB00B_ADC_VINP3                        _UINT32_(1) 
#define PINMUX_PB00B_ADC_VINP3                     ((PIN_PB00B_ADC_VINP3 << 16) | MUX_PB00B_ADC_VINP3)
#define PORT_PB00B_ADC_VINP3                       (_UINT32_(1) << 0)

#define PIN_PA20B_ADC_VINP4                        _UINT32_(20)
#define MUX_PA20B_ADC_VINP4                        _UINT32_(1) 
#define PINMUX_PA20B_ADC_VINP4                     ((PIN_PA20B_ADC_VINP4 << 16) | MUX_PA20B_ADC_VINP4)
#define PORT_PA20B_ADC_VINP4                       (_UINT32_(1) << 20)

#define PIN_PA19B_ADC_VINP5                        _UINT32_(19)
#define MUX_PA19B_ADC_VINP5                        _UINT32_(1) 
#define PINMUX_PA19B_ADC_VINP5                     ((PIN_PA19B_ADC_VINP5 << 16) | MUX_PA19B_ADC_VINP5)
#define PORT_PA19B_ADC_VINP5                       (_UINT32_(1) << 19)

#define PIN_PB18B_ADC_VINP6                        _UINT32_(50)
#define MUX_PB18B_ADC_VINP6                        _UINT32_(1) 
#define PINMUX_PB18B_ADC_VINP6                     ((PIN_PB18B_ADC_VINP6 << 16) | MUX_PB18B_ADC_VINP6)
#define PORT_PB18B_ADC_VINP6                       (_UINT32_(1) << 18)

#define PIN_PB19B_ADC_VINP7                        _UINT32_(51)
#define MUX_PB19B_ADC_VINP7                        _UINT32_(1) 
#define PINMUX_PB19B_ADC_VINP7                     ((PIN_PB19B_ADC_VINP7 << 16) | MUX_PB19B_ADC_VINP7)
#define PORT_PB19B_ADC_VINP7                       (_UINT32_(1) << 19)

#define PIN_PB20B_ADC_VINP8                        _UINT32_(52)
#define MUX_PB20B_ADC_VINP8                        _UINT32_(1) 
#define PINMUX_PB20B_ADC_VINP8                     ((PIN_PB20B_ADC_VINP8 << 16) | MUX_PB20B_ADC_VINP8)
#define PORT_PB20B_ADC_VINP8                       (_UINT32_(1) << 20)

#define PIN_PE03B_ADC_VINP9                        _UINT32_(131)
#define MUX_PE03B_ADC_VINP9                        _UINT32_(1) 
#define PINMUX_PE03B_ADC_VINP9                     ((PIN_PE03B_ADC_VINP9 << 16) | MUX_PE03B_ADC_VINP9)
#define PORT_PE03B_ADC_VINP9                       (_UINT32_(1) << 3)

#define PIN_PA18B_ADC_VINP16                       _UINT32_(18)
#define MUX_PA18B_ADC_VINP16                       _UINT32_(1) 
#define PINMUX_PA18B_ADC_VINP16                    ((PIN_PA18B_ADC_VINP16 << 16) | MUX_PA18B_ADC_VINP16)
#define PORT_PA18B_ADC_VINP16                      (_UINT32_(1) << 18)

#define PIN_PA17B_ADC_VINP17                       _UINT32_(17)
#define MUX_PA17B_ADC_VINP17                       _UINT32_(1) 
#define PINMUX_PA17B_ADC_VINP17                    ((PIN_PA17B_ADC_VINP17 << 16) | MUX_PA17B_ADC_VINP17)
#define PORT_PA17B_ADC_VINP17                      (_UINT32_(1) << 17)

